apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
#include "app_nus_server.h"
#include "app_nus_client.h"
#include "app_timer.h"
#include "app_uart.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_nus.h"
#include "bsp_btn_ble.h"
#include "calendar.h"
#include "fds.h"
#include "leds.h"
#include "filesystem.h"
#include "nrf.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_delay.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "variables.h"

#define APP_BLE_CONN_CFG_TAG           1
#define DEVICE_NAME                    "Repetidor"
#define NUS_SERVICE_UUID_TYPE          BLE_UUID_TYPE_VENDOR_BEGIN
#define APP_BLE_OBSERVER_PRIO          3
#define APP_ADV_INTERVAL               64
#define APP_ADV_DURATION               18000
#define MIN_CONN_INTERVAL              MSEC_TO_UNITS(20, UNIT_1_25_MS)
#define MAX_CONN_INTERVAL              MSEC_TO_UNITS(75, UNIT_1_25_MS)
#define SLAVE_LATENCY                  0
#define CONN_SUP_TIMEOUT               MSEC_TO_UNITS(4000, UNIT_10_MS)
#define FIRST_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(5000)
#define NEXT_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(30000)
#define MAX_CONN_PARAMS_UPDATE_COUNT   3
#define DEAD_BEEF                      0xDEADBEEF
#define LARGO_ADVERTISING              0x18 // Largo_Advertising  10 son 16 y 18 son 24

uint8_t m_beacon_info[LARGO_ADVERTISING];

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);
NRF_BLE_QWR_DEF(m_qwr);
BLE_ADVERTISING_DEF(m_advertising);

static bool                              m_emisor_nus_ready = false;
static app_nus_server_on_data_received_t m_on_data_received = 0;
static uint16_t       m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;
static uint16_t       m_conn_handle          = BLE_CONN_HANDLE_INVALID;
static uint16_t       m_emisor_conn_handle   = BLE_CONN_HANDLE_INVALID;
static uint8_t        custom_mac_addr_[6]    = {0};
static ble_gap_addr_t m_target_periph_addr;

static ble_uuid_t     m_adv_uuids[] = {
           {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may
 * need to inform the application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went
 * wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART
 * BLE Service and send it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t *p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA) {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(
                   p_evt->params.rx_data.p_data,
                   p_evt->params.rx_data.length);

        // Asegúrate de que el mensaje sea tratado como una cadena de texto
        char message[BLE_NUS_MAX_DATA_LEN]; // +1 para el carácter nulo
        if (p_evt->params.rx_data.length < sizeof(message)) {
            memcpy(message,
                   p_evt->params.rx_data.p_data,
                   p_evt->params.rx_data.length);

            message[p_evt->params.rx_data.length] =
                       '\0'; // Agregar terminador nulo

            // Imprime el mensaje recibido
            NRF_LOG_RAW_INFO(
                       "\n\n\x1b[1;36m--- Mensaje recibido: \x1b[0m%s",
                       message);

            // Verifica si el mensaje comienza con "111" par interpretar el
            // comando
            if (p_evt->params.rx_data.length >= 5 && message[0] == '1' &&
                message[1] == '1' && message[2] == '1') {
                // Extrae el comando (los dos caracteres después de "111")
                char command[3] = {
                           message[3],
                           message[4],
                           '\0'}; // Comando de 2 caracteres

                // Manejo de comandos con un switch-case
                switch (atoi(command)) // Convierte el comando a entero
                {
                case 1: // Comando 01: Guardar MAC
                {
                    size_t mac_length = p_evt->params.rx_data.length - 5;
                    if (mac_length == 12) // Verifica que la longitud sea válida
                    {
                        // Parsear la MAC en orden secuencial: aabbccddeeff ->
                        // [aa][bb][cc][dd][ee][ff] en índices
                        // [0][1][2][3][4][5]
                        for (size_t i = 0; i < 6; i++) {
                            char byte_str[3] = {
                                       message[5 + i * 2],
                                       message[6 + i * 2],
                                       '\0'};
                            custom_mac_addr_[i] =
                                       (uint8_t)strtol(byte_str, NULL, 16);
                        }
                        NRF_LOG_RAW_INFO(
                                   "\n\n\x1b[1;36m--- Comando 01 recibido: "
                                   "Cambiar MAC \x1b[0m");
                        NRF_LOG_RAW_INFO(
                                   LOG_INFO " MAC recibida: "
                                            "%02X:%02X:%02X:%02X:%02X:%02X",
                                   custom_mac_addr_[0],
                                   custom_mac_addr_[1],
                                   custom_mac_addr_[2],
                                   custom_mac_addr_[3],
                                   custom_mac_addr_[4],
                                   custom_mac_addr_[5]);

                        // Actualizar la estructura de configuración con la
                        // nueva MAC
                        memcpy(config_repeater.mac_emisor, custom_mac_addr_, 6);
                        NRF_LOG_RAW_INFO(
                                   LOG_OK
                                   " Estructura config_repeater actualizada "
                                   "con nueva MAC");

                        // Guardar la configuración completa en flash (incluye
                        // la nueva MAC)
                        ret_code_t save_result =
                                   save_config_to_flash(&config_repeater);
                        if (save_result == NRF_SUCCESS) {
                            NRF_LOG_RAW_INFO(
                                       LOG_OK
                                       " Configuracion guardada correctamente "
                                       "en flash");
                        }
                        else {
                            NRF_LOG_RAW_INFO(
                                       LOG_FAIL
                                       " Error al guardar configuracion: 0x%X",
                                       save_result);
                        }

                        // También guardar la MAC individualmente para
                        // compatibilidad
                        save_mac_to_flash(MAC_EMISOR, custom_mac_addr_);
                    }
                    else {
                        NRF_LOG_RAW_INFO(
                                   LOG_WARN " Longitud de MAC inválida: %d",
                                   mac_length);
                    }
                    break;
                }
                case 2: // Comando 02: Muestra la MAC custom guardada en la
                    // memoria flash
                    {
                        uint8_t mac_print[6];
                        // Carga la MAC desde la memoria flash
                        NRF_LOG_RAW_INFO(
                                   "\n\n\x1b[1;36m--- Comando 02 recibido: "
                                   "Mostrando "
                                   "MAC "
                                   "guardada \x1b[0m");
                        load_mac_from_flash(MAC_EMISOR, mac_print);
                        // muestra la MAC
                    }

                    break;

