apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                case 3: // Comando 03: Reiniciar el dispositivo
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 03 recibido: "
                               "Reiniciando "
                               "dispositivo...\n\n\n\n");
                    nrf_delay_ms(1000);
                    NVIC_SystemReset();

                    break;

                case 4: // Guardar tiempo de encendido
                {
                    if (p_evt->params.rx_data.length >
                        5) // Verifica que haya al menos "11104X"
                    {
                        // Extrae todos los dígitos después de "11104" (desde
                        // posición 5 hasta el final)
                        size_t digits_len = p_evt->params.rx_data.length - 5;
                        char time_str[16] = {0}; // Buffer para hasta 15 dígitos

                        if (digits_len < sizeof(time_str)) {
                            // Copia todos los dígitos disponibles
                            memcpy(time_str, &message[5], digits_len);
                            time_str[digits_len] = '\0';

                            uint32_t time_in_seconds
                                       __attribute__((aligned(4))) =
                                                  atoi(time_str);
                            uint32_t time_in_ms __attribute__((aligned(4))) =
                                       time_in_seconds *
                                       1000; // Convertir a milisegundos

                            if (time_in_seconds <=
                                9999) // Máximo 9999 segundos (~2.7 horas)
                            {
                                NRF_LOG_RAW_INFO(
                                           "\n\n\x1b[1;36m--- Comando 04 "
                                           "recibido: "
                                           "Cambiar tiempo de encendido "
                                           "\x1b[0m");
                                NRF_LOG_RAW_INFO(
                                           LOG_INFO
                                           " Nuevo tiempo: %u segundos",
                                           time_in_seconds);

                                // Actualizar la estructura de configuración con
                                // el nuevo tiempo
                                config_repeater.tiempo_encendido = time_in_ms;
                                NRF_LOG_RAW_INFO(
                                           LOG_OK " Estructura config_repeater "
                                                  "actualizada");

                                // Guardar la configuración completa en flash
                                ret_code_t save_result = save_config_to_flash(
                                           &config_repeater);
                                if (save_result == NRF_SUCCESS) {
                                    NRF_LOG_RAW_INFO(
                                               LOG_OK " Configuracion guardada "
                                                      "correctamente en flash");
                                }
                                else {
                                    NRF_LOG_RAW_INFO(
                                               LOG_FAIL " Error al guardar "
                                                        "configuracion: 0x%X",
                                               save_result);
                                }

                                // También guardar individualmente para
                                // compatibilidad
                                write_time_to_flash(
                                           TIEMPO_ENCENDIDO,
                                           time_in_ms);
                            }
                            else {
                                NRF_LOG_RAW_INFO(
                                           LOG_WARN
                                           "\nEl tiempo de encendido excede el "
                                           "maximo "
                                           "permitido (9999 segundos).");
                            }
                        }
                        else {
                            NRF_LOG_WARNING(
                                       "Demasiados dígitos para el tiempo de "
                                       "encendido.");
                        }
                    }
                    else {
                        NRF_LOG_RAW_INFO(
                                   LOG_WARN "Comando 04 recibido con datos "
                                            "insuficientes.");
                    }
                    break;
                }

                case 5: // Comando 05: Leer tiempo de encendido
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 05 recibido: "
                               "Leer tiempo de encendido \x1b[0m");
                    uint32_t on_time_ms = read_time_from_flash(
                               TIEMPO_ENCENDIDO,
                               DEFAULT_DEVICE_ON_TIME_MS);

                    NRF_LOG_RAW_INFO(
                               LOG_INFO
                               " Tiempo de encendido configurado: %lu ms",
                               on_time_ms);
                    NRF_LOG_FLUSH();
                    break;
                }

                case 6: // Comando 06: Guardar tiempo de dormido
                {
                    if (p_evt->params.rx_data.length >
                        5) // Verifica que haya al menos "11106X"
                    {
                        // Extrae todos los dígitos después de "11106" (desde
                        // posición 5 hasta el final)
                        size_t digits_len = p_evt->params.rx_data.length - 5;
                        char time_str[16] = {0}; // Buffer para hasta 15 dígitos

                        if (digits_len < sizeof(time_str)) {
                            // Copia todos los dígitos disponibles
                            memcpy(time_str, &message[5], digits_len);
                            time_str[digits_len] = '\0';

                            uint32_t time_in_seconds
                                       __attribute__((aligned(4))) =
                                                  atoi(time_str);
                            uint32_t time_in_ms __attribute__((aligned(4))) =
                                       time_in_seconds *
                                       1000; // Convertir a milisegundos

