apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                            if (time_in_seconds <=
                                9999) // Máximo 9999 segundos (~2.7 horas)
                            {
                                NRF_LOG_RAW_INFO(
                                           "\n\n\x1b[1;36m--- Comando 06 "
                                           "recibido: "
                                           "Cambiar tiempo de dormido \x1b[0m");
                                NRF_LOG_RAW_INFO(
                                           LOG_INFO
                                           " Nuevo tiempo: %u segundos",
                                           time_in_seconds);

                                // Actualizar la estructura de configuración con
                                // el nuevo tiempo
                                config_repeater.tiempo_dormido = time_in_ms;
                                NRF_LOG_RAW_INFO(
                                           LOG_OK " Estructura config_repeater "
                                                  "actualizada");

                                // Guardar la configuración completa en flash
                                ret_code_t save_result = save_config_to_flash(
                                           &config_repeater);
                                if (save_result == NRF_SUCCESS) {
                                    NRF_LOG_RAW_INFO(
                                               LOG_OK " Configuracion guardada "
                                                      "correctamente en flash");
                                }
                                else {
                                    NRF_LOG_RAW_INFO(
                                               LOG_FAIL " Error al guardar "
                                                        "configuracion: 0x%X",
                                               save_result);
                                }

                                // También guardar individualmente para
                                // compatibilidad
                                write_time_to_flash(TIEMPO_SLEEP, time_in_ms);
                            }
                            else {
                                NRF_LOG_RAW_INFO(
                                           LOG_WARN
                                           " El tiempo de dormido excede el "
                                           "maximo "
                                           "permitido (9999 segundos).");
                            }
                        }
                        else {
                            NRF_LOG_WARNING(
                                       "Demasiados dígitos para el tiempo de "
                                       "dormido.");
                        }
                    }
                    else {
                        NRF_LOG_WARNING(
                                   "Comando 06 recibido con datos "
                                   "insuficientes.");
                    }
                    break;
                }

                case 7: // Comando 07: Leer tiempo de dormido
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 07 recibido: "
                               "Leer tiempo de dormido\x1b[0m");
                    uint32_t sleep_time_ms = read_time_from_flash(
                               TIEMPO_SLEEP,
                               DEFAULT_DEVICE_SLEEP_TIME_MS);

                    NRF_LOG_RAW_INFO(
                               LOG_INFO
                               " Tiempo de dormido configurado: %lu [seg]",
                               sleep_time_ms / 1000);
                    NRF_LOG_FLUSH();
                    break;
                }

                case 8: // Comando 08: Guarda la fecha, hora, formato
                        // YYYYMMDDHHMMSS
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 08 recibido: Guardar "
                               "fecha y hora\x1b[0m");

                    if (p_evt->params.rx_data.length >=
                        19) // 5 de comando + 14 de fecha/hora
                    {
                        const char *fecha_iso =
                                   &message[5]; // Al inicio de la fecha/hora

                        datetime_t dt;
                        if (sscanf(fecha_iso,
                                   "%4hu%2hhu%2hhu%2hhu%2hhu%2hhu",
                                   &dt.year,
                                   &dt.month,
                                   &dt.day,
                                   &dt.hour,
                                   &dt.minute,
                                   &dt.second) == 6) {
                            NRF_LOG_RAW_INFO(
                                       LOG_INFO " Fecha recibida: "
                                                "%04u-%02u-%02u %02u:%02u:%02u",
                                       dt.year,
                                       dt.month,
                                       dt.day,
                                       dt.hour,
                                       dt.minute,
                                       dt.second);

                            // Actualizar la estructura de configuración con la
                            // nueva fecha
                            config_repeater.fecha = dt;
                            NRF_LOG_RAW_INFO(
                                       LOG_OK " Estructura config_repeater "
                                              "actualizada");

                            // Guardar la configuración completa en flash
                            ret_code_t save_result =
                                       save_config_to_flash(&config_repeater);
                            if (save_result == NRF_SUCCESS) {
                                NRF_LOG_RAW_INFO(
                                           LOG_OK " Configuracion guardada "
                                                  "correctamente en flash");
                            }
                            else {
                                NRF_LOG_RAW_INFO(
                                           LOG_FAIL " Error al guardar "
                                                    "configuracion: 0x%X",
                                           save_result);
                            }
                            nrf_delay_ms(50); // Delay tras escribir
                            // También guardar individualmente para
                            // compatibilidad
                            err_code = write_date_to_flash(&dt);
                            if (err_code != NRF_SUCCESS) {
                                NRF_LOG_RAW_INFO(
                                           LOG_FAIL " Error guardando fecha "
                                                    "individualmente: 0x%X",
                                           err_code);
                            }
                        }
                        else {
                            NRF_LOG_RAW_INFO(
                                       LOG_WARN
                                       " Formato invalido. Se esperaba "
                                       "YYYYMMDDHHMMSS.");
                        }
                    }
                    else {
                        NRF_LOG_RAW_INFO(
                                   LOG_WARN " Datos insuficientes. Se "
                                            "esperaban 14 digitos");
                    }
                    break;
                }
                case 9: // Comando 09: Leer fecha y hora almacenada en flash
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 09 recibido: Leer "
                               "fecha "
                               "y hora\x1b[0m");

                    // Leer fecha de la memoria flash
                    datetime_t dt = read_date_from_flash();

                    // Mostrar fecha leída
                    NRF_LOG_RAW_INFO(
                               LOG_INFO " Fecha almacenada: %04u/%02u/%02u "
                                        "%02u:%02u:%02u",
                               dt.year,
                               dt.month,
                               dt.day,
                               dt.hour,
                               dt.minute,
                               dt.second);

                    break;
                }
                case 10: // Guarda en la memoria el tiempo de encendido
                         // extendido
                {
                    if (p_evt->params.rx_data.length >
                        5) // Verifica que haya al menos "11110X"
                    {
                        // Extrae todos los dígitos después de "11110" (desde
                        // posición 5 hasta el final)
                        size_t digits_len = p_evt->params.rx_data.length - 5;
                        char time_str[16] = {0}; // Buffer para hasta 15 dígitos

                        if (digits_len < sizeof(time_str)) {
                            // Copia todos los dígitos disponibles
                            memcpy(time_str, &message[5], digits_len);
                            time_str[digits_len] = '\0';

                            uint32_t time_in_seconds
                                       __attribute__((aligned(4))) =
                                                  atoi(time_str);
                            uint32_t time_in_ms =
                                       time_in_seconds *
                                       1000; // Convertir a milisegundos

