apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                            if (time_in_seconds <=
                                9999) // Máximo 9999 segundos (~2.7 horas)
                            {
                                NRF_LOG_RAW_INFO(
                                           "\n\n\x1b[1;36m--- Comando 10 "
                                           "recibido: "
                                           "Cambiar tiempo de encendido "
                                           "extendido "
                                           "\x1b[0m");
                                NRF_LOG_RAW_INFO(
                                           LOG_INFO
                                           " Nuevo tiempo: %u segundos",
                                           time_in_seconds);

                                // Actualizar la estructura de configuración con
                                // el nuevo tiempo
                                config_repeater.tiempo_extendido = time_in_ms;
                                NRF_LOG_RAW_INFO(
                                           LOG_OK " Estructura config_repeater "
                                                  "actualizada");

                                // Guardar la configuración completa en flash
                                ret_code_t save_result = save_config_to_flash(
                                           &config_repeater);
                                if (save_result == NRF_SUCCESS) {
                                    NRF_LOG_RAW_INFO(
                                               LOG_OK " Configuracion guardada "
                                                      "correctamente en flash");
                                }
                                else {
                                    NRF_LOG_RAW_INFO(
                                               LOG_FAIL " Error al guardar "
                                                        "configuracion: 0x%X",
                                               save_result);
                                }

                                // También guardar individualmente para
                                // compatibilidad
                                write_time_to_flash(
                                           TIEMPO_EXTENDED_ENCENDIDO,
                                           time_in_ms);
                            }
                            else {
                                NRF_LOG_RAW_INFO(
                                           LOG_WARN
                                           " El tiempo de encendido "
                                           "extendido excede el máximo "
                                           "permitido (9999 segundos).");
                            }
                        }
                        else {
                            NRF_LOG_RAW_INFO(
                                       LOG_WARN
                                       " Demasiados dígitos para el tiempo "
                                       "de encendido extendido.");
                        }
                    }
                    else {
                        NRF_LOG_RAW_INFO(
                                   LOG_WARN " Comando 10 recibido con datos "
                                            "insuficientes.");
                    }
                    break;
                }
                case 11: // Comando 11: Leer tiempo de encendido extendido desde
                         // la memoria flash
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 11 recibido: "
                               "Leer tiempo de encendido extendido \x1b[0m");
                    uint32_t extended_time_ms = read_time_from_flash(
                               TIEMPO_EXTENDED_ENCENDIDO,
                               DEFAULT_DEVICE_EXTENDED_ON_TIME_MS);

                    NRF_LOG_RAW_INFO(
                               LOG_INFO " Tiempo de encendido extendido actual "
                                        ": %u segundos",
                               extended_time_ms / 1000);
                    break;
                }
                case 12: // Guardar tiempo de encendido modo extendido
                {
                    if (p_evt->params.rx_data.length >
                        5) // Verifica que haya al menos "11112X"
                    {
                        // Extrae todos los dígitos después de "11112" (desde
                        // posición 5 hasta el final)
                        size_t digits_len = p_evt->params.rx_data.length - 5;
                        char time_str[16] = {0}; // Buffer para hasta 15 dígitos

                        if (digits_len < sizeof(time_str)) {
                            // Copia todos los dígitos disponibles
                            memcpy(time_str, &message[5], digits_len);
                            time_str[digits_len] = '\0';

                            uint32_t time_in_seconds
                                       __attribute__((aligned(4))) =
                                                  atoi(time_str);
                            uint32_t time_in_ms __attribute__((aligned(4))) =
                                       time_in_seconds *
                                       1000; // Convertir a milisegundos

                            if (time_in_seconds <=
                                9999) // Máximo 9999 segundos (~2.7 horas)
                            {
                                NRF_LOG_RAW_INFO(
                                           "\n\n\x1b[1;36m--- Comando 12 "
                                           "recibido: "
                                           "Cambiar tiempo de dormido "
                                           "extendido "
                                           "\x1b[0m");
                                NRF_LOG_RAW_INFO(
                                           LOG_INFO
                                           " Configurando: %u segundos",
                                           time_in_seconds);

                                write_time_to_flash(
                                           TIEMPO_EXTENDED_SLEEP,
                                           time_in_ms);
                            }
                            else {
                                NRF_LOG_WARNING(
                                           "El tiempo de dormido extendido "
                                           "excede el "
                                           "máximo "
                                           "permitido (9999 segundos).");
                            }
                        }
                        else {
                            NRF_LOG_WARNING(
                                       "Demasiados digitos para el tiempo de "
                                       "dormido "
                                       "extendido.");
                        }
                    }
                    else {
                        NRF_LOG_WARNING(
                                   "Comando 12 recibido con datos "
                                   "insuficientes.");
                    }
                    break;
                }

                case 13: // Leer tiempo de sleep modo extendido
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 13 recibido: "
                               "Leer tiempo de dormido extendido\x1b[0m");
                    uint32_t extended_sleep_time_ms = read_time_from_flash(
                               TIEMPO_EXTENDED_SLEEP,
                               DEFAULT_DEVICE_EXTENDED_SLEEP_TIME_MS);

