apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                    NRF_LOG_RAW_INFO(
                               LOG_INFO " Tiempo de dormido extendido actual: "
                                        "%u segundos",
                               extended_sleep_time_ms / 1000);

                    break;
                }

                case 14: // Solicita un historial por ID
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 14 recibido: "
                               "Solicitar "
                               "registro de "
                               "historial por ID\x1b[0m");
                    if (p_evt->params.rx_data.length >
                        5) // Verifica que haya datos suficientes
                    {
                        // Extrae el ID del registro como string (todo lo que
                        // sigue después de "11114")
                        size_t id_len  = p_evt->params.rx_data.length - 5;
                        char id_str[8] = {0}; // Soporta hasta 7 dígitos, ajusta
                                              // si necesitas más
                        if (id_len < sizeof(id_str)) {
                            memcpy(id_str, &message[5], id_len);
                            id_str[id_len]       = '\0';
                            uint16_t registro_id = (uint16_t)atoi(id_str);

                            // Llama a la función para solicitar el registro por
                            // ID
                            store_history registro_historial;
                            err_code = read_history_record_by_id(
                                       registro_id,
                                       &registro_historial);
                            if (err_code == NRF_SUCCESS) {
                                NRF_LOG_RAW_INFO(
                                           LOG_OK
                                           " Registro %u leido correctamente, "
                                           "enviando por NUS...",
                                           registro_id);

                                // Preparar array de datos en formato hex (igual
                                // que send_all_history)
                                uint8_t  data_array[244];
                                uint16_t position = 0;

                                // Byte 0: Magic
                                data_array[position++] = 0x08;

                                // Bytes 1-7: Fecha y hora
                                data_array[position++] = registro_historial.day;
                                data_array[position++] =
                                           registro_historial.month;
                                data_array[position++] =
                                           (registro_historial.year >> 8) &
                                           0xFF;
                                data_array[position++] =
                                           (registro_historial.year & 0xFF);
                                data_array[position++] =
                                           registro_historial.hour;
                                data_array[position++] =
                                           registro_historial.minute;
                                data_array[position++] =
                                           registro_historial.second;

                                // Bytes 8-11: Contador (4 bytes) - convertir a
                                // big-endian
                                data_array[position++] =
                                           (registro_historial.contador >> 24) &
                                           0xFF;
                                data_array[position++] =
                                           (registro_historial.contador >> 16) &
                                           0xFF;
                                data_array[position++] =
                                           (registro_historial.contador >> 8) &
                                           0xFF;
                                data_array[position++] =
                                           (registro_historial.contador & 0xFF);

                                // Bytes 12-15: V1, V2 (2 bytes cada uno) -
                                // convertir a big-endian
                                data_array[position++] =
                                           (registro_historial.V1 >> 8) & 0xFF;
                                data_array[position++] =
                                           (registro_historial.V1 & 0xFF);
                                data_array[position++] =
                                           (registro_historial.V2 >> 8) & 0xFF;
                                data_array[position++] =
                                           (registro_historial.V2 & 0xFF);

                                // Byte 16: Battery
                                data_array[position++] =
                                           registro_historial.battery;

                                // Bytes 17-28: MACs (rellenar con ceros)
                                for (int j = 0; j < 12; j++) {
                                    data_array[position++] = 0x00;
                                }

                                // Bytes 29-40: V3-V8 (2 bytes cada uno) -
                                // convertir a big-endian
                                data_array[position++] =
                                           (registro_historial.V3 >> 8) & 0xFF;
                                data_array[position++] =
                                           (registro_historial.V3 & 0xFF);
                                data_array[position++] =
                                           (registro_historial.V4 >> 8) & 0xFF;
                                data_array[position++] =
                                           (registro_historial.V4 & 0xFF);
                                data_array[position++] =
                                           (registro_historial.V5 >> 8) & 0xFF;
                                data_array[position++] =
                                           (registro_historial.V5 & 0xFF);
                                data_array[position++] =
                                           (registro_historial.V6 >> 8) & 0xFF;
                                data_array[position++] =
                                           (registro_historial.V6 & 0xFF);
                                data_array[position++] =
                                           (registro_historial.V7 >> 8) & 0xFF;
                                data_array[position++] =
                                           (registro_historial.V7 & 0xFF);
                                data_array[position++] =
                                           (registro_historial.V8 >> 8) & 0xFF;
                                data_array[position++] =
                                           (registro_historial.V8 & 0xFF);

