apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                                // Byte 41: Temperatura
                                data_array[position++] =
                                           registro_historial.temp;

                                // Byte 42-43: ID del registro solicitado (en
                                // lugar de last_position)
                                data_array[position++] =
                                           (registro_id >> 8) & 0xFF;
                                data_array[position++] = (registro_id & 0xFF);

                                // Enviar por NUS al celular
                                ret_code_t send_result =
                                           app_nus_server_send_data(
                                                      data_array,
                                                      position);
                                if (send_result == NRF_SUCCESS) {
                                    NRF_LOG_RAW_INFO(
                                               LOG_OK " Registro #%u "
                                                      "enviado "
                                                      "por NUS "
                                                      "exitosamente",
                                               registro_id);
                                }
                                else {
                                    NRF_LOG_RAW_INFO(
                                               LOG_FAIL " Error enviando "
                                                        "registro "
                                                        "#%u "
                                                        "por NUS: 0x%X",
                                               registro_id,
                                               send_result);
                                }

                                // También imprimir en consola para depuración
                                char titulo[41];
                                snprintf(titulo,
                                         sizeof(titulo),
                                         "Historial enviado \x1B[33m#%u\x1B[0m",
                                         registro_id);
                                print_history_record(
                                           &registro_historial,
                                           titulo);
                                NRF_LOG_FLUSH();
                            }
                            else {
                                NRF_LOG_RAW_INFO(
                                           LOG_FAIL " Error al leer el "
                                                    "registro "
                                                    "%u: 0x%X",
                                           registro_id,
                                           err_code);
                            }
                        }
                        else {
                            NRF_LOG_WARNING("ID de registro demasiado largo.");
                        }
                    }
                    break;
                }

                case 15: // Envía todos los historiales por BLE
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 15 : Solicitud del "
                               "historial completo\x1b[0m");
                    // Llama a la función para solicitar el historial completo
                    send_all_history();

                    break;
                }
                case 16: // Comando 16: Enviar configuracion actual
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 16 recibido: Enviar "
                               "configuracion "
                               "actual\x1b[0m");
                    send_config_via_ble();
                    break;
                }

                case 17: // Guarda la MAC custom del repetidor
                {
                    size_t mac_length = p_evt->params.rx_data.length - 5;
                    if (mac_length == 12) // Verifica que la longitud sea válida
                    {
                        uint8_t mac_repetidor[6];
                        // Parsear la MAC en orden secuencial: aabbccddeeff ->
                        // [aa][bb][cc][dd][ee][ff] en índices
                        // [0][1][2][3][4][5]
                        for (size_t i = 0; i < 6; i++) {
                            char byte_str[3] = {
                                       message[5 + i * 2],
                                       message[6 + i * 2],
                                       '\0'};
                            mac_repetidor[i] =
                                       (uint8_t)strtol(byte_str, NULL, 16);
                        }
                        NRF_LOG_RAW_INFO(
                                   "\n\n\x1b[1;36m--- Comando 17 recibido: "
                                   "Cambiar MAC del repetidor \x1b[0m");
                        NRF_LOG_RAW_INFO(
                                   LOG_INFO " MAC del repetidor recibida: "
                                            "%02X:%02X:%02X:%02X:%02X:%02X",
                                   mac_repetidor[0],
                                   mac_repetidor[1],
                                   mac_repetidor[2],
                                   mac_repetidor[3],
                                   mac_repetidor[4],
                                   mac_repetidor[5]);

                        // Actualizar la estructura de configuración con la
                        // nueva MAC del repetidor
                        memcpy(config_repeater.mac_repetidor, mac_repetidor, 6);

                        // Habilitar automáticamente la MAC custom cuando se
                        // guarda una nueva
                        config_repeater.enable_custom_mac_repetidor = true;

                        NRF_LOG_RAW_INFO(
                                   LOG_OK
                                   " Estructura config_repeater actualizada "
                                   "con nueva MAC del repetidor");
                        NRF_LOG_RAW_INFO(
                                   LOG_INFO
                                   " MAC custom habilitada automaticamente");

                        // Guardar la configuración completa en flash (incluye
                        // la nueva MAC del repetidor)
                        ret_code_t save_result =
                                   save_config_to_flash(&config_repeater);
                        if (save_result == NRF_SUCCESS) {
                            NRF_LOG_RAW_INFO(
                                       LOG_OK
                                       " Configuracion guardada correctamente "
                                       "en flash");
                        }
                        else {
                            NRF_LOG_RAW_INFO(
                                       LOG_FAIL
                                       " Error al guardar configuracion: 0x%X",
                                       save_result);
                        }

