apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                        // También guardar la MAC del repetidor individualmente
                        // para compatibilidad
                        save_mac_to_flash(MAC_REPETIDOR, mac_repetidor);
                    }
                    else {
                        NRF_LOG_WARNING(
                                   "Longitud de MAC del repetidor invalida: %d",
                                   mac_length);
                    }
                    break;
                }
                case 18: // Comando 18: Leer MAC del repetidor guardada
                {
                    uint8_t mac_print[6];
                    // Carga la MAC del repetidor desde la memoria flash
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 18 recibido: "
                               "Mostrando "
                               "MAC del repetidor guardada \x1b[0m");
                    load_mac_from_flash(MAC_REPETIDOR, mac_print);

                    // Verificar si se cargó una MAC válida
                    if (mac_print[0] == 0 && mac_print[1] == 0 &&
                        mac_print[2] == 0 && mac_print[3] == 0 &&
                        mac_print[4] == 0 && mac_print[5] == 0) {
                        NRF_LOG_RAW_INFO(
                                   LOG_WARN " No hay MAC del repetidor "
                                            "guardada en memoria");
                    }
                    else {
                        NRF_LOG_RAW_INFO(
                                   LOG_OK " MAC del repetidor: "
                                          "%02X:%02X:%02X:%02X:%02X:%02X",
                                   mac_print[0],
                                   mac_print[1],
                                   mac_print[2],
                                   mac_print[3],
                                   mac_print[4],
                                   mac_print[5]);
                    }
                    break;
                }

                case 19: // Comando 19: Habilitar/Deshabilitar MAC custom del
                         // repetidor
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 19 recibido: "
                               "Configurar uso de MAC custom del repetidor "
                               "\x1b[0m");

                    if (p_evt->params.rx_data.length >= 2) {
                        uint8_t enable_flag =
                                   p_evt->params.rx_data
                                              .p_data[1]; // 0 = deshabilitar, 1
                                                          // = habilitar

                        config_repeater.enable_custom_mac_repetidor =
                                   (enable_flag != 0);

                        NRF_LOG_RAW_INFO(
                                   LOG_INFO " MAC custom del repetidor %s",
                                   config_repeater.enable_custom_mac_repetidor
                                              ? "HABILITADA"
                                              : "DESHABILITADA");

                        // Guardar la configuración completa en flash
                        ret_code_t save_result =
                                   save_config_to_flash(&config_repeater);
                        if (save_result == NRF_SUCCESS) {
                            NRF_LOG_RAW_INFO(
                                       LOG_OK " Configuracion guardada "
                                              "correctamente en flash");
                        }
                        else {
                            NRF_LOG_RAW_INFO(
                                       LOG_FAIL
                                       " Error al guardar configuracion: 0x%X",
                                       save_result);
                        }
                    }
                    else {
                        NRF_LOG_RAW_INFO(
                                   LOG_WARN " Longitud de datos insuficiente");
                    }
                    break;
                }

                case 20: // Comando 20: Leer estado de MAC custom del repetidor
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 20 recibido: Leer "
                               "estado de MAC custom del repetidor \x1b[0m");

                    NRF_LOG_RAW_INFO(
                               LOG_INFO " MAC custom del repetidor esta %s",
                               config_repeater.enable_custom_mac_repetidor
                                          ? "HABILITADA"
                                          : "DESHABILITADA");

                    break;
                }

                case 99: // Comando para borrar todos los historiales
                {
                    NRF_LOG_RAW_INFO(
                               "\n\n\x1b[1;36m--- Comando 99 recibido: Borrar "
                               "todos "
                               "los "
                               "historiales\x1b[0m");

                    delete_all_history();
                    break;
                }
                default: // Comando desconocido
                    NRF_LOG_WARNING("Comando desconocido: %s", command);
                    break;
                }
            }
            else {
                // Reenvía el mensaje al emisor o lo maneja normalmente
                if (m_on_data_received) {
                    m_on_data_received(
                               (uint8_t *)message,
                               p_evt->params.rx_data.length);
                }
            }
        }
        else {
            NRF_LOG_WARNING("Mensaje demasiado largo para procesar.");
        }
    }
    else if (p_evt->type == BLE_NUS_EVT_TX_RDY) {
        // El buffer de transmisión está listo - enviar siguiente paquete del
        // comando 15/16 si está activo También manejar el envío asíncrono de
        // historial
        history_send_next_packet();
    }
}

static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

