apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type = BLE_ADVDATA_NO_NAME; // BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    init.config.ble_adv_on_disconnect_disabled = true;
    init.advdata.p_manuf_specific_data         = &manuf_specific_data;

    init.srdata.uuids_complete.uuid_cnt =
               sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids = m_adv_uuids;

    init.config.ble_adv_fast_enabled   = true;
    init.config.ble_adv_fast_interval  = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout   = APP_ADV_DURATION;
    init.evt_handler                   = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

/**@brief Function for starting advertising.
 */
void advertising_start(void)
{
    uint32_t err_code =
               ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    if (err_code != NRF_SUCCESS) {
        NRF_LOG_RAW_INFO(
                   LOG_FAIL "\n Fallo al comenzar con el advertising: 0x%08X\n",
                   err_code);
    }
    // Posible crash
    APP_ERROR_CHECK(err_code);
}

void advertising_stop(void)
{
    sd_ble_gap_adv_stop(m_advertising.adv_handle);
}

void disconnect_all_devices(void)
{
    ret_code_t err_code;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
        err_code = sd_ble_gap_disconnect(
                   m_conn_handle,
                   BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        m_conn_handle = BLE_CONN_HANDLE_INVALID;
        NRF_LOG_RAW_INFO(LOG_INFO " Celular desconectado");
        nrf_gpio_pin_clear(LED2_PIN);
    }

    if (m_emisor_conn_handle != BLE_CONN_HANDLE_INVALID) {
        err_code = sd_ble_gap_disconnect(
                   m_emisor_conn_handle,
                   BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        m_emisor_conn_handle = BLE_CONN_HANDLE_INVALID;
        NRF_LOG_RAW_INFO(LOG_INFO " Emisor desconectado");
        nrf_gpio_pin_clear(LED3_PIN);
    }
}

void app_nus_server_init(app_nus_server_on_data_received_t on_data_received)
{
    m_on_data_received = on_data_received;
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    advertising_start();
}
